examples/tube/setup_files/openfoam_esi3d/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2312
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          1e-5;

        smoother        DICGaussSeidel;

    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "pcorr.*"
    {
        $p;
        tolerance       1e-10;
        relTol          1e-5;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          1e-5;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    cellDisplacement
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-10;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors              3;
    nOuterCorrectors         50;
    outerCorrectorResidualControl
    {
        U
        {
            tolerance   1e-8;
            relTol      0;
        }
        p
        {
            tolerance   1e-7;
            relTol      0;
        }
    }
}


// ************************************************************************* //
